app/views/nutriologo_pages/metas_cita.html.erb

SELECT  "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "sesions".* FROM "sesions" WHERE "sesions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% @paciente_id=Sesion.find(@cita).paciente_id%>