app/views/nutriologo_pages/mis_sesiones.html.erb

                </div>
                <% if Time.now > Horario.find(sesion.hora_id).hora_disponible %>
---
SELECT  "horarios".* FROM "horarios" WHERE "horarios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]