app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents"
---
  def index
    @document = Document.all