app/controllers/meta_controller.rb

  def update
    @meta.update(meta_params)
---
UPDATE "meta" SET "cumplida" = ?, "updated_at" = ? WHERE "meta"."id" = ?  [["cumplida", "t"], ["updated_at", "2018-11-10 23:28:56.304993"], ["id", 1]]

  def create


    @meta= Meta.new(meta_params)



      if @meta.save
---
INSERT INTO "meta" ("meta", "sesions_id", "paciente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["meta", "jhghj"], ["sesions_id", 1], ["paciente_id", 1], ["created_at", "2018-11-11 04:00:38.744363"], ["updated_at", "2018-11-11 04:00:38.744363"]]

    def set_params
      @meta = Meta.find(params[:id])
---
SELECT  "meta".* FROM "meta" WHERE "meta"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]