app/controllers/nutriologo_pages_controller.rb

SELECT  "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? ORDER BY "pacientes"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def metas_paciente
    @paciente = params[:id]
    @ppaciente = Paciente.find_by(id: @paciente)

SELECT  "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pacientes" SET "objetivo" = ?, "updated_at" = ? WHERE "pacientes"."id" = ?  [["objetivo", "Correr más"], ["updated_at", "2018-11-24 20:36:34.680240"], ["id", 1]]
---
  def cambiar_objetivo
    if @paciente = Paciente.find_by(id: params[:id])
       if @paciente.update(objetivo: params[:paciente][:objetivo])