app/controllers/sesions_controller.rb

  def edit
    @sesion = Sesion.find(params[:id])
    @paciente = Paciente.find(@sesion.paciente_id)
---
SELECT  "sesions".* FROM "sesions" WHERE "sesions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? ORDER BY "pacientes"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @sesion.peso != nil && @sesion.estatura != nil && @sesion.grasa != nil && @sesion.musculo != nil && @sesion.imc != nil && @sesion.grasa_vis != nil && @sesion.edad_metabolica != nil
      @sesion.active = false
      @sesion.save!
---
UPDATE "sesions" SET "peso" = ?, "estatura" = ?, "grasa" = ?, "musculo" = ?, "agua" = ?, "imc" = ?, "grasa_vis" = ?, "edad_metabolica" = ?, "updated_at" = ? WHERE "sesions"."id" = ?  [["peso", 6.0], ["estatura", 6.0], ["grasa", 6.0], ["musculo", 6.0], ["agua", 6.0], ["imc", 6.0], ["grasa_vis", 6.0], ["edad_metabolica", 6], ["updated_at", "2018-11-11 04:04:17.893343"], ["id", 1]]

  def create


    @sesion= Sesion.new(sesion_params)
    if(@sesion.nutriologo_id==nil && @sesion.hora_id !=nil)
      @sesion.nutriologo_id = Horario.find(@sesion.hora_id).nutriologo_id
    end
    Horario.where(id: @sesion.hora_id).update(apartada: true)
    respond_to do |format|


      if @sesion.save
---
SELECT  "horarios".* FROM "horarios" WHERE "horarios"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "nutriologos".* FROM "nutriologos" WHERE "nutriologos"."id" = ? ORDER BY "nutriologos"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "horarios" SET "apartada" = ?, "updated_at" = ? WHERE "horarios"."id" = ?  [["apartada", "t"], ["updated_at", "2018-11-15 14:45:23.216000"], ["id", 1]]
INSERT INTO "sesions" ("peso", "hora", "fecha", "paciente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["peso", 15.0], ["hora", ""], ["fecha", "2018-11-22"], ["paciente_id", 1], ["created_at", "2018-11-10 03:07:14.391119"], ["updated_at", "2018-11-10 03:07:14.391119"]]

    def set_sesion
      @sesion = Sesion.find(params[:id])
---
SELECT  "sesions".* FROM "sesions" WHERE "sesions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]