app/controllers/tips_ycomentarios_controller.rb

  def create


    @tip= TipsYcomentario.new(tips_params)



      if @tip.save
---
INSERT INTO "tips_ycomentarios" ("tip", "remitente", "nutriologo_id", "paciente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tip", "kjhk"], ["remitente", "MartinPac"], ["nutriologo_id", 2], ["paciente_id", 1], ["created_at", "2018-11-13 22:51:37.944869"], ["updated_at", "2018-11-13 22:51:37.944869"]]